I did the `import` with the following command (I was unclear what ID to pass here, since this :

```bash
terraform import \
  azurerm_app_service_source_control.main \
  "/subscriptions/xxx/resourceGroups/RG-CDT-PUB-VIP-CALITP-D-001/providers/Microsoft.Web/sites/AS-CDT-PUB-VIP-CALITP-D-001"
```

And it looks like it worked:

```console
data.azurerm_resource_group.main: Reading...
data.azurerm_client_config.current: Reading...
azurerm_app_service_source_control.main: Importing from ID "/subscriptions/xxx/resourceGroups/RG-CDT-PUB-VIP-CALITP-D-001/providers/Microsoft.Web/sites/AS-CDT-PUB-VIP-CALITP-D-001"...
azurerm_app_service_source_control.main: Import prepared!
  Prepared azurerm_app_service_source_control for import
azurerm_app_service_source_control.main: Refreshing state...

Import successful!

The resources that were imported are shown above. These resources are now in
your Terraform state and will henceforth be managed by Terraform.
```

This resulted in zero file changes locally:

```bash
$ git status
On branch dev
Your branch is up to date with 'origin/dev'.
```

Then getting the output of the current state:

```bash
terraform show
```

Which has the current state for the source control block as:

```tf
# azurerm_app_service_source_control.main:
resource "azurerm_app_service_source_control" "main" {
  app_id                 = "/subscriptions/xxx/resourceGroups/RG-CDT-PUB-VIP-CALITP-D-001/providers/Microsoft.Web/sites/AS-CDT-PUB-VIP-CALITP-D-001"
  branch                 = "dev"
  id                     = "/subscriptions/xxx/resourceGroups/RG-CDT-PUB-VIP-CALITP-D-001/providers/Microsoft.Web/sites/AS-CDT-PUB-VIP-CALITP-D-001"
  repo_url               = "https://github.com/cal-itp/benefits"
  rollback_enabled       = false
  scm_type               = "GitHubAction"
  use_local_git          = false
  use_manual_integration = false
  use_mercurial          = false
  uses_github_action     = true

  timeouts {}
}
```

Comparing against the local config with `plan`:

```bash
terraform plan
```

We see there are some changes:

```console
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_app_service_source_control.main must be replaced
-/+ resource "azurerm_app_service_source_control" "main" {
      ~ id                     = "/subscriptions/xxx/resourceGroups/RG-CDT-PUB-VIP-CALITP-D-001/providers/Microsoft.Web/sites/AS-CDT-PUB-VIP-CALITP-D-001" -> (known after apply)
      ~ rollback_enabled       = false -> true # forces replacement
      ~ scm_type               = "GitHubAction" -> (known after apply)
      ~ uses_github_action     = true -> (known after apply)
        # (6 unchanged attributes hidden)

      + github_action_configuration { # forces replacement
          + generate_workflow_file = false # forces replacement
          + linux_action           = (known after apply)

          + container_configuration {
              + image_name   = "cal-itp/benefits" # forces replacement
              + registry_url = "https://ghcr.io/" # forces replacement
            }
        }

      - timeouts {}
    }

  # azurerm_linux_web_app.main will be updated in-place
  ~ resource "azurerm_linux_web_app" "main" {
      ~ app_settings                       = {
          + "WEBSITE_HTTPLOGGING_RETENTION_DAYS"  = "99999"
            # (23 unchanged elements hidden)
        }
        # (20 unchanged attributes hidden)
        # (5 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
